# GetSolid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementIntersectsSolidFilter..::..GetSolid Method
ElementIntersectsSolidFilter Class See Also
---
Gets the target solid geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Solid GetSolid()
```

Visual Basic
---
```text
Public Function GetSolid As Solid
```

Visual C++
---
```text
public:
Solid^ GetSolid()
```

# ### Return Value
The solid geometry.
# See Also
ElementIntersectsSolidFilter Class
Autodesk.Revit.DB Namespace